---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterIn
source: html/84efff3b-dc62-9d0b-997e-d1326c82f438.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterIn Property

"Main Primary Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDiameterIn { get; }
```